<script setup>
import AppButton from "@/components/AppButton/index.vue";
</script>

<template>
  <main>
    <h1>Устройство компьютера</h1>
    <div class="wrapper">
      <h2 class="wrapper-title">Вводная часть</h2>
      <p class="wrapper-text">
        Данные — это записанная (зафиксированная) информация.
      </p>
      <p class="wrapper-text">
        Для того, чтоб компьютер мог обрабатывать данные автоматический (без
        участия человека), ему нужно как-то сообщить, что он должен делать и в
        какой последовательности. Программа — это инструкция для компьютера.
        Программа состоит из отдельных команд и должна бть записана на языке,
        понятном компьютеру.
      </p>
      <p class="wrapper-text">
        Для того, чтоб компьютер мог обрабатывать данные автоматический (без
        участия человека), ему нужно как-то сообщить, что он должен делать и в
        какой последовательности. Программа — это инструкция для компьютера.
        Программа состоит из отдельных команд и должна бть записана на языке,
        понятном компьютеру. 
      </p>
    </div>
    <AppButton text="Назад" link="/" />
  </main>
</template>
<style>
@import url("./index.scss");
</style>
